Repository: flyingcircusio/doc
Catalog: src/locales/*/LC_MESSAGES/reference/security/data-protection.po
Languages: de

source: The security of data entry, change, and deletion is generally part of the customer's application. Customers must ensure that data entry, deletion, and removal are handled appropriately according to their applicable data protection laws.
de: Die Sicherheit der Dateneingabe, -änderung und -löschung ist generell Teil der Anwendung des Kunden. Kunden müssen sicherstellen, dass die Dateneingabe, -löschung und -entfernung entsprechend ihrer geltenden Datenschutzgesetze angemessen gehandhabt wird.

source: However, during maintenance work it may be necessary that administrators need to enter, change, or delete data records on a low technical level to ensure the continued operation of the overall system. This will only happen after having informed the affected customers and having documented this in our issue tracking system.
de: Im Rahmen von Wartungsarbeiten kann es jedoch notwendig sein, dass Administratoren auf einem niedrigen technischen Niveau Datensätze eingeben, ändern oder löschen müssen, um den weiteren Betrieb des Gesamtsystems zu gewährleisten. Dies wird nur geschehen, nachdem wir die betroffenen Kunden informiert und dies in unserem Issue-Tracking-System dokumentiert haben.

source: Managed log files are rotated by the Flying Circus infrastructure automatically with sensible retention times.
de: Verwaltete Log-Dateien werden von der Flying Circus Infrastruktur automatisch mit sinnvollen Aufbewahrungszeiten rotiert.

source: Changes in the Flying Circus portal (e.g., SSH keys) can be performed by the customer themselves or through our support. If the change happens through our support then it must be documented beforehand and confirmed by the customer after the change has been performed.
de: Änderungen im Flying Circus Benutzerverzeichnis (z.B. SSH-Schlüssel) können vom Kunden selbst oder durch unseren Support durchgeführt werden. Erfolgt die Änderung durch unseren Support, so muss diese vorher dokumentiert und nach der Änderung durch den Kunden bestätigt werden.

source: (8). Transport control
de: (8) Transportkontrolle

source: **Purpose: ensure that the confidentiality and integrity of personal data are protected during transfers of personal data or during transport of data media**
de: **Zweck: Gewährleistung, dass bei der Übermittlung personenbezogener Daten sowie beim Transport von Datenträgern die Vertraulichkeit und Integrität der Daten geschützt werden**

source: All private data transferred past the boundary of a machine must use an authenticated and encrypted communication channel (exceptions see below). Data paths where sensitive information may be transferred include:
de: Alle privaten Daten, die über die Grenze einer Maschine hinaus übertragen werden, müssen einen authentifizierten und verschlüsselten Kommunikationskanal nutzen (Ausnahmen siehe unten). Zu den Datenpfaden, auf denen sensible Informationen übertragen werden können, gehören:

source: Application data (e.g., database contents) is transferred from or to the customer using the standardised encrypted protocols, e.g., SCP/SFTP, https.
de: Anwendungsdaten (z.B. Datenbankinhalte) werden vom oder zum Kunden über die standardisierten verschlüsselten Protokolle, z.B. SCP/SFTP, https, übertragen.

source: Persistent data is saved on storage servers. Storage traffic is not encrypted due to performance reasons. Storage servers are connected to application servers using a private network. Machines on which administrative privileges are granted to customers are not allowed to connect directly to the storage network (see also {ref}`network-security`).
de: Persistente Daten werden auf Storage-Servern gespeichert. Der Speicherverkehr wird aus Performance-Gründen nicht verschlüsselt. Storage-Server sind mit Anwendungsservern über ein privates Netzwerk verbunden. Maschinen, auf denen Kunden administrative Privilegien gewährt werden, dürfen sich nicht direkt mit dem Speichernetzwerk verbinden (siehe auch {ref}`network-security`).

source: Backups are transferred to backup servers at the same site using either an encrypted communication channel or the private storage network. Backup data may also be transferred to off-site backup servers to improve disaster recovery abilities. The transfer must be encrypted.
de: Backups werden entweder über einen verschlüsselten Kommunikationskanal oder über das private Speichernetzwerk auf Backup-Server am selben Standort übertragen. Backup-Daten können auch auf externe Backup-Server übertragen werden, um die Desaster-Recovery-Fähigkeiten zu verbessern. Die Datenübertragung muss verschlüsselt erfolgen.

source: In addition to application data, a system can generate data at runtime that contains sensitive information, for example log files. Log files usually do not leave the machine on which they were generated, unless the customer operates a logging server. Log data may also be transferred to a log server on the same site operated by Flying Circus via an encrypted channel. Only Flying Circus administrators may have access to the central log server.
de: Zusätzlich zu den Anwendungsdaten kann ein System zur Laufzeit Daten erzeugen, die sensible Informationen enthalten, zum Beispiel Log-Dateien. Log-Dateien verlassen in der Regel nicht den Rechner, auf dem sie erzeugt wurden, es sei denn, der Kunde betreibt einen Logging-Server. Log-Daten können auch über einen verschlüsselten Kanal an einen von Flying Circus betriebenen Log-Server am selben Standort übertragen werden. Nur Flying Circus-Administratoren dürfen Zugriff auf den zentralen Log-Server haben.

source: (9). Recovery
de: (9) Wiederherstellbarkeit

source: **Purpose: ensure that installed systems may, in the case of interruption, be restored**
de: **Zweck: Gewährleistung, dass eingesetzte Systeme im Störungsfall wiederhergestellt werden können**

source: Recovery scenarios are documented at {ref}`disaster-recovery`.
de: Wiederherstellungsszenarien sind unter {ref}`disaster-recovery` dokumentiert.

source: (10) Reliability
de: (10) Zuverlässigkeit

source: **Purpose: ensure that all system functions perform and that the appearance of faults in the functions is reported**
de: **Zweck: Gewährleistung, dass alle Funktionen des Systems zur Verfügung stehen und auftretende Fehlfunktionen gemeldet werden**

source: All systems are monitored continuously. Depending on the severity of the monitored system our emergency support is notified, a support ticket is created automatically, or tickets are created manually during monitoring review.
de: Alle Systeme werden kontinuierlich überwacht. Je nach Wichtigkeit des überwachten Systems wird unser Notfall-Support benachrichtigt, ein Support-Ticket automatisch erstellt, oder manuell ein Ticket während der Monitoring-Review erstellt.

source: (11) Integrity
de: (11) Datenintegrität

source: **Purpose: ensure that stored personal data cannot be corrupted by means of a malfunctioning of the system**
de: **Zweck: Gewährleistung, dass gespeicherte personenbezogene Daten nicht durch Fehlfunktionen des Systems beschädigt werden können**

source: Integrity is assured on several levels:
de: Integrität wird auf mehreren Ebenen gewährleistet:

source: filesystem-level checksums on XFS filesystems
de: Prüfsummen auf Dateisystemebene bei XFS-Dateisystemen

source: block-level checksums on Ceph bluestore OSDs
de: Prüfsummen auf Blockebene bei Ceph bluestore OSDs

source: redundant storage of data
de: Redundante Speicherung von Daten

source: backups of data with hash-based integrity checks, see {ref}`backup`.
de: Datensicherungen mit Hash-basierten Integritätsprüfungen, siehe {ref}`backup`.

source: For details and recovery times, see {ref}`disaster-recovery`.
de: Einzelheiten und Wiederherstellungszeiten finden Sie unter {ref}`disaster-recovery`.

source: (12) Processing control
de: (12) Auftragskontrolle

source: **Purpose: ensure that personal data processed on behalf of the controller can only be processed in compliance with the controller’s instructions**
de: **Zweck: Gewährleistung, dass personenbezogene Daten, die im Auftrag verarbeitet werden, nur entsprechend den Weisungen des Auftraggebers verarbeitet werden können**

source: The Flying Circus ensures that all actions taken by system administrators are covered by a contract or order with the customers affected by the action. This can be due to broad maintenance contracts or due to specific support requests.
de: Der Flying Circus stellt sicher, dass alle von Systemadministratoren durchgeführten Aktionen durch einen Vertrag oder Auftrag mit den von der Aktion betroffenen Kunden abgedeckt sind. Dies kann aufgrund von breit angelegten Wartungsverträgen oder aufgrund von spezifischen Supportanfragen sein.

source: Individual change requests should have an associated ticket in the Flying Circus request tracking system. Other means of documentation to control changes are possible, e.g., explanatory commit messages in a version control system.
de: Einzelne Änderungsanfragen sollten ein zugehöriges Ticket im Flying Circus Request-Tracking-System haben. Andere Mittel der Dokumentation zur Kontrolle von Änderungen sind möglich, z.B. erklärende Commit-Nachrichten in einem Versionskontrollsystem.

source: Specific actions performed will be reported to the customer if required.
de: Spezifische durchgeführte Aktionen werden dem Kunden bei Bedarf mitgeteilt.

source: (13) Availability control
de: (13) Verfügbarkeitskontrolle

source: **Purpose: ensure that personal data are protected against loss and destruction**
de: **Zweck: Gewährleistung, dass personenbezogene Daten gegen Zerstörung oder Verlust geschützt sind**

source: The availability of resources depending on the data center facilities is delegated to the operator of the data center. The Flying Circus facilitates service level agreements to make expectations about availability explicit.
de: Die Verfügbarkeit von Ressourcen, in Abhängigkeit von den Rechenzentrumseinrichtungen, wird an den Betreiber des Rechenzentrums delegiert. Bereitgestellte Service Level Agreements ermöglichen dem Flying Circus, die Erwartungen an die Verfügbarkeit explizit zu machen.

source: The selection of hardware is performed by the Flying Circus using professional equipment and vendors. The Flying Circus facilitates standard procedures for increased availability of single components (e.g., RAID storages, redundant power supplies, spare components).
de: Die Auswahl der Hardware wird vom Flying Circus mit professionellem Equipment und Anbietern durchgeführt. Der Flying Circus ermöglicht Standardverfahren zur Erhöhung der Verfügbarkeit einzelner Komponenten (z.B. RAID-Speicher, redundante Netzteile, Ersatzkomponenten).

source: Customer data is regularly backed up according to the Flying Circus' {ref}`backup schedule <backup>`. Restoration of past states may be performed by administrators on request. Additionally, a {ref}`disaster recovery plan <disaster-recovery>` details failure scenarios, our preventative and recovery measures.
de: Die Kundendaten werden regelmäßig nach dem Flying Circus {ref}`Backup-Plan <backup>` gesichert. Die Wiederherstellung vergangener Zustände kann von Administratoren auf Anfrage durchgeführt werden. Zusätzlich gibt es einen {ref}`Desaster Recovery Plan <disaster-recovery>`, der Ausfallszenarien, unsere Präventiv- und Wiederherstellungsmaßnahmen detailliert beschreibt.

source: (14) Separability
de: (14) Trennbarkeit

source: **Purpose: ensure that personal data collected for different purposes can be processed separately**
de: **Zweck: Gewährleistung, dass zu unterschiedlichen Zwecken erhobene personenbezogene Daten getrennt verarbeitet werden können**

source: To separate data from different customers the Flying Circus facilitates virtualization: both virtual machines (to separate execution context) and virtualized storage (Ceph) ensures that customers can only access data belonging to them. Within a single machine access to different files and processes is available using standard UNIX permissions.
de: Um die Daten verschiedener Kunden zu trennen, nutzt der Flying Circus Virtualisierung: Sowohl virtuelle Maschinen (zur Trennung des Ausführungskontextes) als auch virtualisierte Festplatten (Ceph) sorgen dafür, dass Kunden nur auf die ihnen gehörenden Daten zugreifen können. Innerhalb einer einzelnen Maschine ist der Zugriff auf verschiedene Dateien und Prozesse über Standard-UNIX-Berechtigungen möglich.

source: Machines (both virtual and physical) live in a specific *access ring* (short: ring):
de: Maschinen (sowohl virtuelle als auch physische) leben in einem bestimmten *Access Ring* (kurz: Ring):

source: *Ring 0* machines perform infrastructure tasks. Thus, they need to process data belonging to several customers. Only administrator access is allowed on such machines. Examples include VM hosts and storage servers.
de: *Ring 0* Maschinen führen Infrastrukturaufgaben aus. So müssen sie Daten verarbeiten, die zu mehreren Kunden gehören. Auf solchen Maschinen ist nur Administratoren der Zugriff erlaubt. Beispiele sind VM-Hosts und Storage-Server.

source: *Ring 1* machines process data for a specific customer and are accessible to users associated to that customer. Examples include customer VMs.
de: *Ring 1* Maschinen verarbeiten Daten für einen bestimmten Kunden und sind für Benutzer zugänglich, die mit diesem Kunden verbunden sind. Beispiele sind Kunden-VMs.

source: All resources that belong logically together (e.g., VMs, storage volumes) are bundled into *resource groups*. Resource groups share that same set of user accounts and permissions.
de: Alle Ressourcen, die logisch zusammengehören (z.B. VMs, Storage Volumes), werden in *Ressourcen-Gruppen* gebündelt. Projekte teilen sich dasselbe Set an Benutzerkonten und Berechtigungen.

source: Access to S3-compatible object storage buckets is separated by resource group with dedicated authentication credentials.
de: Der Zugriff auf S3-kompatible Objektspeicher-Buckets wird pro Ressourcengruppe mit dedizierten Authentifizierungsdaten getrennt.

source: Other measures
de: Andere Maßnahmen

source: Our support process and incident response measures are documented at {ref}`the support overview <support-details>`.
de: Unser Supportprozess und die Maßnahmen zur Reaktion auf Vorfälle sind unter {ref}`Support-Details <support-details>` dokumentiert.

source: We have a process for emergency and crisis management including contingency plans for critical business processes (business continuity). See also {ref}`disaster-recovery`.
de: Wir haben einen Prozess für Notfall- und Krisenmanagement einschließlich Notfallplänen für kritische Geschäftsprozesse (Business Continuity). Siehe auch {ref}`disaster-recovery`.

source: Footnotes
de: Fußzeile

source: If a customer owns equipment managed within the Flying Circus we require that this customer uses a separate rack with separate access control.
de: Wenn ein Kunde Equipment besitzt, das innerhalb des Flying Circus verwaltet wird, verlangen wir, dass dieser Kunde ein separates Rack mit separater Zugangskontrolle nutzt.

source: We consider not logging unsuccessful logins acceptable, as SSH logins are only valid using cryptographic private/public key authentication. Password logins are always rejected. Potential attack vectors are thus limited to stolen or cracked private keys or vulnerabilities in the SSH server software. Cracked keys are practically impossible using current technology. Known broken key formats are revoked/rejected regularly. Stolen keys or errors in the server software will not be traceable using unsuccessful login records either. On the opposite: the amount of password login tries performed nowadays (due to bot nets etc.) would cause spamming of the logging infrastructure which in turn can be a vector for DOS attacks.
de: Wir halten es für akzeptabel, erfolglose Logins nicht zu protokollieren, da SSH-Logins nur mit kryptographischer Private/Public-Key-Authentifizierung gültig sind. Passwort-Logins werden immer abgelehnt. Mögliche Angriffsvektoren beschränken sich somit auf gestohlene oder geknackte private Schlüssel oder Schwachstellen in der SSH-Server-Software. Geknackte Schlüssel sind mit der aktuellen Technologie praktisch unmöglich. Bekannte geknackte Schlüsselformate werden regelmäßig widerrufen/zurückgewiesen. Gestohlene Schlüssel oder Fehler in der Serversoftware lassen sich auch nicht über erfolglose Login-Datensätze nachvollziehen. Im Gegenteil: Die Menge an Passwort-Login-Versuchen, die heutzutage durchgeführt werden (aufgrund von Bot-Netzen etc.), würde zu einem Spamming der Logging-Infrastruktur führen, was wiederum ein Vektor für DOS-Angriffe sein kann.

source: Individual actions performed with administrative privileges are only partially logged.
de: Einzelne Aktionen, die mit administrativen Rechten durchgeführt werden, werden nur teilweise protokolliert.
