Repository: flyingcircusio/doc
Catalog: src/locales/*/LC_MESSAGES/reference/security/data-protection.po
Languages: de

source: Data protection measures
de: Datenschutzmaßnahmen

source: In addition to purely technical security measures we implement additional measures to provide a safe environment for your and your customers' data based on the following standards and regulations:
de: Neben rein technischen Sicherheitsmaßnahmen implementieren wir zusätzliche Maßnahmen, um eine sichere Umgebung für deine und die Daten deiner Kunden zu schaffen, basierend auf den folgenden Standards und Vorschriften:

source: [Certified](https://flyingcircus.io/iso-27001-en.pdf) Information Security Management System (ISMS) based on ISO/IEC 27001,
de: [Zertifiziertes](https://flyingcircus.io/iso-27001-de.pdf) Informationssicherheitsmanagementsystem (ISMS) basierend auf ISO/IEC 27001,

source: Germany's [federal data protection law (BDSG)](http://de.wikipedia.org/wiki/Bundesdatenschutzgesetz), and
de: Das `Bundesdatenschutzgesetz (BDSG) <http://de.wikipedia.org/wiki/Bundesdatenschutzgesetz>`_, und

source: the EU's [General Data Protection Regulation (GDPR)](https://de.wikipedia.org/wiki/Datenschutz-Grundverordnung).
de: die [Datenschutz-Grundverordnung (DS-GVO)](https://de.wikipedia.org/wiki/Datenschutz-Grundverordnung) der EU.

source: Responsible bodies
de: Verantwortliche Stellen

source: **Information Security officers:**
de: **Informationssicherheitsbeauftragte:**

source: **Data protection officer:**
de: **Datenschutzbeauftragter:**

source: General
de: Allgemein

source: This document describes the security measures required by GDPR Art. 32 (1). Based on our ISO 27001 certification we operate a risk-based ISMS leading to extensive security measures and documentation. We don't replicate the entire documentation here but only the gist.
de: Dieses Dokument beschreibt unsere Sicherheitsmaßnahmen, gemäß GDPR Art. 32 (1). Basierend auf unserer ISO 27001-Zertifizierung betreiben wir ein risikobasiertes ISMS, aus dem sich umfangreichen Sicherheitsmaßnahmen und Dokumentationen ergeben. Wir geben hier nicht die gesamte Dokumentation wieder, sondern nur die Quintessenz.

source: As some of the requirements of the law depend on the specific (contractual) situation, we'd like to first outline the general situation that hosting in the Flying Circus puts you in:
de: Da einige der Anforderungen des Gesetzes von der spezifischen (vertraglichen) Situation abhängen, möchten wir zunächst die allgemeine Situation skizzieren, in die dich das Hosting im Flying Circus bringt:

source: Order data processing
de: Auftragsverarbeitung

source: applies within the framework of the GDPR. We will implement a contract for data processing suitable to the GDPR with you.
de: gilt im Rahmen der DS-GVO. Wir werden mit dir einen zur DS-GVO passenden Vertrag zur Datenverarbeitung umsetzen.

source: Duty to give information
de: Auskunfsrecht

source: People who are affected by processing of data have right to request information about what data about them is being stored as well as about the processes how this data is being kept secure.
de: Personen, die von der Datenverarbeitung betroffen sind, haben das Recht, Auskunft darüber zu verlangen, welche Daten über sie gespeichert sind und wie diese Daten gesichert werden.

source: Periodical check for compliance to regulations:
de: Regelmäßige Überprüfung auf Einhaltung der Vorschriften:

source: The client has the responsibility to routinely check that applicable regulations are being conformed to by their contractor. Yearly checks appear to be sufficient even for highly sensitive data (e.g. medical records). The result needs to be documented in written form. The audit usually needs to be performed by a third party.
de: Es liegt in der Verantwortung des Auftraggebers, routinemäßig zu überprüfen, ob die geltenden Vorschriften von seinem Auftragnehmer eingehalten werden. Jährliche Kontrollen scheinen auch bei hochsensiblen Daten (z.B. Krankenakten) ausreichend zu sein. Das Ergebnis muss in schriftlicher Form dokumentiert werden. Die Prüfung muss in der Regel durch eine dritte Partei durchgeführt werden.

source: Measures
de: Maßnahmen

source: (1) Equipment access control
de: (1) Zugangskontrolle

source: **Purpose: deny unauthorized persons access to processing equipment used for processing**
de: **Zweck: Verwehrung des Zugangs zu Verarbeitungsanlagen, mit denen die Verarbeitung durchgeführt wird, für Unbefugte**

source: The physical assets (servers, switches, hard drives, ...) are located in EU data centers operated by third parties. The ownership of the physical equipment is with the Flying Circus, or, in special cases by our customers [^customer-owned].
de: Die physischen Anlagen (Server, Switches, Festplatten, ...) befinden sich in EU-Rechenzentren, die von Dritten betrieben werden. Das Eigentum an den physischen Anlagen liegt beim Flying Circus, oder, in besonderen Fällen, bei unseren Kunden [^customer-owned].

source: For each data center used by us we require the following measures:
de: Für jedes von uns genutzte Rechenzentrum verlangen wir die folgenden Maßnahmen:

source: video surveillance (outside facilities, in-doors and rack corridors)
de: Videoüberwachung (Außenanlagen, Innenräume und Rack-Korridore)

source: two-factor security for granting access (e.g. personal password and transponder card) with logging
de: Ein zweiter Faktoren für die Zugangsgewährung (z.B. persönliches Passwort und Transponderkarte) mit Protokollierung

source: physical access must be documented
de: der physische Zugang muss dokumentiert werden

source: preferably 24 hour guard services with linked alarm system
de: vorzugsweise 24 Stunden Wachdienst mit vernetztem Alarmsystem

source: separate physical security zones for general areas, data center infrastructure and customer-accessible areas
de: getrennte physische Sicherheitszonen für allgemeine Bereiche, Rechenzentrumsinfrastruktur und für Kunden zugängliche Bereiche

source: separately locked racks with the possibility to use custom locks and keys.
de: separat abschließbare Racks mit der Möglichkeit eigene Schlösser und Schlüssel zu verwenden.

source: We maintain a separate {ref}`data-centers`.
de: Wir unterhalten ein separates {ref}`data-centers`.

source: Physical access to data processing equipment may be performed only by the Flying Circus' administrators. Administrators may delegate physical access to other people (e.g., data center personnel).
de: Der physische Zugang zu Datenverarbeitungsanlagen darf nur von den Flying Circus Administratoren vorgenommen werden. Administratoren können den physischen Zugang an andere Personen (z.B. Mitarbeiter des Rechenzentrums) delegieren.

source: Low-security locations
de: Standorte mit niedriger Sicherheit

source: The Flying Circus operates one low-security zone called `development` (used for the development of the Flying Circus infrastructure).
de: Der Flying Circus betreibt eine Zone mit geringerer Sicherheit, die `development` (für die Entwicklung der Infrastruktur des Flying Circus) genannt wird.

source: Those locations are currently not allowed to be used for customer data storage as they are not sufficiently protected.
de: Diese Standorte dürfen derzeit nicht für die Speicherung von Kundendaten genutzt werden, da sie nicht ausreichend geschützt sind.

source: Due to this limitations, the services in high-security locations are not allowed to depend on services provided in low-security locations.
de: Aufgrund dieser Einschränkungen dürfen die Dienste in Hochsicherheitsbereichen nicht von den Diensten in Niedrigsicherheitsbereichen abhängen.

source: (2) Data media control
de: (2) Datenträgerkontrolle

source: **Purpose: prevent the unauthorized reading, copying, modification or erasure of data media**
de: **Zweck: Verhinderung des unbefugten Lesens, Kopierens, Veränderns oder Löschens von Datenträgern**

source: Only Flying Circus administrators may have physical access to data media. Access may be delegated e.g. to data center personnel.
de: Nur Flying Circus Administratoren dürfen physischen Zugriff auf Datenträger haben. Der Zugriff kann z.B. an Mitarbeiter des Rechenzentrums delegiert werden.

source: Transfer of data media between secure locations is handled by Flying Circus personnel or trusted shipping providers.
de: Die Überführung von Datenträgern zwischen sicheren Standorten wird von Flying Circus Mitarbeitern oder vertrauenswürdigen Versanddienstleistern abgewickelt.

source: Disposal of used media happens using a certified data destruction service provider.
de: Die Entsorgung genutzten Medien erfolgt über einen zertifizierten Datenvernichtungsdienstleister.

source: (3) Storage control
de: (3) Speicherkontrolle

source: **Purpose: prevent the unauthorized input of personal data and the unauthorized inspection, modification or deletion of stored personal data**
de: **Zweck: Verhinderung der unbefugten Eingabe von personenbezogenen Daten sowie der unbefugten Kenntnisnahme, Veränderung und Löschung von gespeicherten personenbezogenen Daten**

source: All data in our [storage clusters](#infrastructure-storage) is stored encrypted. This includes the *Virtual Disk Block Storage*, our *S3-compatible Object Storage*, and {ref}`all automated backups <backup>`. There are technical and organisational measures in place to protect the relevant keys.
de: Alle Daten in unseren [Speicherclustern](#infrastructure-storage) werden verschlüsselt gespeichert. Dazu gehören der *Virtual Disk Block Storage*, unser *S3-kompatibler Object Storage* und {ref}`alle automatisierten Backups <backup>`. Es gibt technische und organisatorische Maßnahmen zum Schutz der entsprechenden Schlüssel.

source: On a technical level, we utilise the common Linux [cryptsetup] (https://gitlab.com/cryptsetup/cryptsetup) software stack with LUKS2 metadata and XTS-AES-512 cipher. We regularly review recommendations in standard guidelines or working groups and are able to update the used encryption parameters as needed.
de: Auf technischer Ebene verwenden wir den üblichen Linux [cryptsetup] (https://gitlab.com/cryptsetup/cryptsetup) Software-Stack mit LUKS2-Metadaten und XTS-AES-512-Verschlüsselung. Wir überprüfen regelmäßig die Empfehlungen in Standardrichtlinien und Arbeitsgruppen und sind in der Lage, die verwendeten Verschlüsselungsparameter bei Bedarf zu aktualisieren.

source: Additionally:
de: Außerdem:

source: We delete data after the retention times required by tax or commercial law.
de: Wir löschen Daten nach den steuer- oder handelsrechtlichen Aufbewahrungsfristen.

source: Access log files are being anonymised.
de: Die Zugriffslogdateien werden anonymisiert.

source: We delete customer data upon customer's request.
de: Wir löschen Kundendaten auf Wunsch des Kunden.

source: (4) User control
de: (4) Benutzerkontrolle

source: **Purpose: prevent the use of automated processing systems by unauthorized persons using data communication equipment**
de: **Zeck: Verhinderung der Nutzung automatisierter Verarbeitungssysteme mit Hilfe von Einrichtungen zur Datenübertragung durch Unbefugte**

source: Machines managed within the Flying Circus can be accessed by a variety of ways for management purposes: SSH, web interfaces, and others. For those we employ a homogeneous scheme to identify and authorize users within the Flying Circus. Management access to systems must use encrypted communication channels.
de: Maschinen, die von des Flying Circus verwaltet werden, können über eine Vielzahl von Wegen zu Verwaltungszwecken erreicht werden: SSH, Webinterfaces und andere. Für diese verwenden wir ein einheitliches Schema, um Benutzer innerhalb des Flying Circus zu identifizieren und zu autorisieren. Der Zugriff zur Verwaltung der Systeme muss über verschlüsselte Kommunikationskanäle erfolgen.

source: Identification and authorization of customer applications, not managed by the Flying Circus infrastructure, are not covered by our security responsibility. Our customers are required to ensure the security of their applications themselves.
de: Die Identifizierung und Autorisierung durch Kundenanwendungen, die nicht von der Flying Circus Infrastruktur verwaltet werden, fallen nicht unter unsere Sicherheitsverantwortung. Unsere Kunden sind verpflichtet, die Sicherheit ihrer Anwendungen selbst zu gewährleisten.

source: User identification must be performed using *personal* credentials, so that actions can be traced back to an individual originator. Thus, sharing one's credentials with another person is prohibited. Credentials can be either a username and a cryptographic measure (e.g. a private/public key scheme) or a password, depending on the applicability.
de: Die Benutzeridentifikation muss mit *persönlichen* Anmeldedaten erfolgen, damit Aktionen zu einem individuellen Urheber zurückverfolgt werden können. Daher ist es verboten, seine Anmeldedaten mit einer anderen Person zu teilen. Abhängig von der Anwendung können Anmeldedaten entweder ein Benutzername und eine kryptographische Maßnahme (z.B. ein privates/öffentliches Schlüsselschema) oder ein Passwort sein.

source: Users with a Flying Circus account are required to manage their password securely: Passwords must not become compromised if a device is being accessed unauthorizedly (logically or physically). Things to consider are for example: Home directory on a notebook, keychain or password manager software, backups, USB sticks, smartphones. Strongly encrypted storage of passwords is permitted and even advised. For Flying Circus staff there is a separate *guideline for handling secret authentication information*.
de: Nutzer mit einem Flying-Circus-Konto sind verpflichtet, ihr Passwort sicher zu verwalten: Passwörter dürfen nicht kompromittiert werden, wenn auf ein Gerät unbefugt zugegriffen wird (logisch oder physisch). Zu beachtende Dinge sind z.B.: Home-Verzeichnis auf einem Notebook, Schlüsselbund oder Passwortmanager-Software, Backups, USB-Sticks, Smartphones. Stark verschlüsselte Speicherung von Passwörtern ist erlaubt und sogar angeraten. Für Flying Circus Mitarbeiter gibt es eine separate *Richtlinie zum Umgang mit geheimen Authentifizierungsinformationen*.

source: All hardware machines have emergency root logins which may only be used by Flying Circus administrators if regular user authentication is not working correctly. Such uses are monitored and must be documented.
de: Alle Hardware-Maschinen haben Notfall-Root-Logins, die nur von Flying Circus Administratoren verwendet werden dürfen, wenn die reguläre Benutzerauthentifizierung nicht korrekt funktioniert. Solche Verwendungen werden überwacht müssen dokumentiert werden.

source: All privileged actions need to be securely logged. For machines based on our current (NixOS) platform, this is achieved via a local logging journal, which cannot be tampered with by normal users. Additionally systems logs are shipped to a central log server within the same site where the logs are analysed and monitored.
de: Alle privilegierten Aktionen müssen sicher protokolliert werden. Für Maschinen, die auf unserer aktuellen (NixOS) Plattform basieren, wird dies über ein lokales Logging-Journal erreicht, das von normalen Benutzern nicht manipuliert werden kann. Zusätzlich werden die Systemlogs an einen zentralen Logserver innerhalb des gleichen Standorts versendet, wo die Logs analysiert und überwacht werden.

source: SSH logins must be performed using SSH keys. Password authentication is not allowed and prevented by the system configuration. Successful SSH logins to machines are logged, unsuccessful SSH login attempts are not [^log-unsuccessful-attempts]. Excessive unsuccessful SSH login attempts automatically cause a blocking via firewall rules.
de: SSH-Logins müssen mit SSH-Schlüsseln durchgeführt werden. Passwortauthentifizierung ist nicht erlaubt und wird durch die Systemkonfiguration verhindert. Erfolgreiche SSH-Anmeldungen an Maschinen werden protokolliert, erfolglose SSH-Anmeldeversuche nicht [^log-unsuccessful-attempts]. Übermäßige fehlschlagende Login-Versuche per SSH werden automatisch per Firewall unterbunden.

source: (5) Data access control
de: (5) Zugriffskontrolle

source: **Purpose: ensure that persons authorized to use an automated processing system have access only to the personal data covered by their access authorization**
de: **Zweck: Gewährleistung, dass die zur Benutzung eines automatisierten Verarbeitungssystems Berechtigten ausschließlich zu den von ihrer Zugangsberechtigung umfassten personenbezogenen Daten Zugang haben**

source: Customer-owned virtual machines may be accessed by all Flying Circus administrators implicitly. In projects additional staff (e.g. support staff) may get explicit access. Access by others (e.g., customer personnel, third parties) must be authorised by a client representative.
de: Auf kundeneigene virtuelle Maschinen können alle Flying Circus Administratoren implizit zugreifen. In Projekten können weitere Mitarbeiter (z.B. Support-Mitarbeiter) expliziten Zugriff erhalten. Der Zugriff durch andere (z.B. Kundenpersonal, Dritte) muss durch einen Kundenvertreter autorisiert werden.

source: Users are centrally managed using <https://my.flyingcircus.io>. Users are automatically provisioned to all relevant systems, including proper removal of access rights.
de: Benutzer werden zentral über <https://my.flyingcircus.io> verwaltet. Benutzer werden automatisch auf alle relevanten Systeme provisioniert, einschließlich der ordnungsgemäßen Entfernung von Zugriffsrechten.

source: Flying Circus implements a permission-based concept to separate application maintenance tasks from privileged administrative tasks: for example, customer software updates or database access versus OS updates or OS configuration.
de: Flying Circus implementiert ein auf Berechtigungen basierendes Konzept, um Aufgaben der Anwendungswartung von privilegierten administrativen Aufgaben zu trennen: zum Beispiel Kundensoftware-Updates oder Datenbankzugriff versus Betriebssystem-Updates oder Betriebssystemkonfiguration.

source: Privileged administrative access is generally not granted to customers. In cases where another person who is not an administrator is needed to solve a problem, a shared session between an administrator and the other person must be established (e.g. with {command}`screen`).
de: Privilegierter administrativer Zugriff wird generell nicht an Kunden gewährt. In Fällen, in denen eine andere Person, die kein Administrator ist, benötigt wird, um ein Problem zu lösen, muss eine gemeinsame Sitzung zwischen einem Administrator und der anderen Person eingerichtet werden (z.B. mit {command}`screen`).

source: Technically, there are three access variants to perform privileged administrative operations:
de: Technisch gesehen gibt es drei Zugangsvarianten, um privilegierte administrative Operationen durchzuführen:

source: Using a user account which has been granted the 'login' and 'wheel' {ref}`permissions <permissions>` for a certain project. This requires the user to log into a regular account using his SSH key and additionally provide his password to access privileged operations.
de: Verwendung eines Benutzerkontos, dem die 'login' und 'wheel' {ref}`Berechtigungen <permissions>` für ein bestimmtes Projekt erteilt wurden. Dies erfordert, dass der Benutzer sich mit seinem SSH-Schlüssel in einen regulären Account einloggt und zusätzlich sein Passwort angibt, um auf privilegierte Operationen zuzugreifen.

source: Using a user account which is member of the global group of administrators which grants access to all machines within the Flying Circus infrastructure.
de: Die Verwendung eines Benutzerkontos, das Mitglied der globalen Gruppe der Administratoren ist, die Zugriff auf alle Maschinen innerhalb der Flying Circus Infrastruktur gewährt.

source: Emergency root logins (see above in {ref}`entry-control`).
de: Notfall-Root-Logins (siehe oben in {ref}`entry-control`).

source: Authorized and unauthorized access to privileged operations is logged and analysed on a central loghost within the same site. [^trace-tty]
de: Autorisierte und unautorisierte Zugriffe auf privilegierte Operationen werden auf einem zentralen Loghost innerhalb desselben Standorts protokolliert und analysiert. [^trace-tty]

source: Flying Circus maintains a set of permissions which enable users to perform application maintenance and other semi-privileged tasks, e.g. access to service user accounts or database administration rights. Permissions are granted to individual users by the customer or upon customer request.
de: Flying Circus unterhält eine Reihe von Berechtigungen, die es den Nutzern ermöglichen, Anwendungswartung und andere semi-privilegierte Aufgaben durchzuführen, z.B. Zugriff auf Service-Benutzerkonten oder Datenbank-Administrationsrechte. Die Berechtigungen werden den einzelnen Nutzern durch den Kunden oder auf Kundenwunsch gewährt.

source: All permission assignments are traceable and explicitly documented: their effects are documented in the configuration code and their assignments are documented in the configuration database. A comprehensive list of users and their permissions may be produced automatically on request.
de: Alle Berechtigungsvergaben sind nachvollziehbar und explizit dokumentiert: ihre Auswirkungen werden im Konfigurationscode und ihre Zuordnungen in der Konfigurationsdatenbank dokumentiert. Eine umfassende Liste der Benutzer und ihrer Berechtigungen kann auf Wunsch automatisch erstellt werden.

source: Group accounts are generally not allowed to perform privileged administrative operations to ensure traceability of actions.
de: Gruppenkonten dürfen generell keine privilegierten administrativen Operationen durchführen, um die Nachvollziehbarkeit von Aktionen zu gewährleisten.

source: Passwords for physical machines granting access to root accounts and IPMI controllers are stored as copies in a strongly encrypted password manager.
de: Passwörter für physische Maschinen, die Zugriff auf Root-Konten und IPMI-Controller gewähren, werden als Kopien in einem stark verschlüsselten Passwortmanager gespeichert.

source: (6) Communication control
de: (6) Übertragungskontrolle

source: **Purpose: ensure that it is possible to verify and establish the bodies to which personal data have been or may be transmitted or made available using data communication equipment**
de: **Zweck: Gewährleistung, dass überprüft und festgestellt werden kann, an welche Stellen personenbezogene Daten mit Hilfe von Einrichtungen zur Datenübertragung übermittelt oder zur Verfügung gestellt wurden oder werden können**

source: Communication control is generally the responsibility of the customer's application.
de: Die Übertragungskontrolle liegt in der Regel in der Verantwortung der Anwendung des Kunden.

source: Data entered into the Flying Circus portal is not transmitted to third parties.
de: In das Flying Circus Portal eingegebene Daten werden nicht an Dritte weitergegeben.

source: (7) Input control
de: (7) Eingabekontrolle

source: **Purpose: ensure that it is subsequently possible to verify and establish which personal data have been input into automated processing systems and when and by whom the personal data were input**
de: **Zweck: Gewährleistung, dass nachträglich überprüft und festgestellt werden kann, welche personenbezogenen Daten zu welcher Zeit und von wem in automatisierte Verarbeitungssysteme eingegeben oder verändert worden sind**
